Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: هو الذي بعث في الأميين رسولا منهم يتلو عليهم آياته ويزكيهم ويعلمهم الكتاب والحكمة وإن كانوا من قبل لفي ضلال مبين
en: He it is Who sent among the unlettered ones a Messenger (Muhammad صلى الله عليه وسلم) from among themselves, reciting to them His Verses, purifying them (from the filth of disbelief and polytheism), and teaching them the Book (this Qur'an, Islamic laws and Islamic jurisprudence) and Al-Hikmah (As-Sunnah: legal ways, orders, acts of worship of Prophet Muhammad صلى الله عليه وسلم). And verily, they had been before in manifest error;

source: وآخرين منهم لما يلحقوا بهم وهو العزيز الحكيم
en: And [He has sent him (Prophet Muhammad صلى الله عليه وسلم) also to] others among them (Muslims) who have not yet joined them (but they will come). And He (Allah) is the All-Mighty, the All-Wise.

source: ذلك فضل الله يؤتيه من يشاء والله ذو الفضل العظيم
en: That is the Grace of Allah, which He bestows on whom He wills. And Allah is the Owner of Mighty Grace.

source: مثل الذين حملوا التوراة ثم لم يحملوها كمثل الحمار يحمل أسفارا بئس مثل القوم الذين كذبوا بآيات الله والله لا يهدي القوم الظالمين
en: The likeness of those who were entrusted with the (obligation of the) Taurat (Torah) (i.e. to obey its commandments and to practise its laws), but who subsequently failed in those (obligations), is as the likeness of a donkey which carries huge burdens of books (but understands nothing from them). How bad is the example of people who deny the Ayat (proofs, evidence, verses, signs, revelations) of Allah. And Allah guides not the people who are Zalimun (polytheists, wrong-doers, disbelievers).

source: قل يا أيها الذين هادوا إن زعمتم أنكم أولياء لله من دون الناس فتمنوا الموت إن كنتم صادقين
en: Say (O Muhammad صلى الله عليه وسلم): "O you Jews! If you pretend that you are friends of Allah, to the exclusion of (all) other mankind, then long for death if you are truthful."

source: ولا يتمنونه أبدا بما قدمت أيديهم والله عليم بالظالمين
en: But they will never long for it (death), because of what (deeds) their hands have sent before them! And Allah knows well the Zalimun (polytheists, wrong-doers, disbelievers).

source: قل إن الموت الذي تفرون منه فإنه ملاقيكم ثم تردون إلى عالم الغيب والشهادة فينبئكم بما كنتم تعملون
en: Say (to them): "Verily, the death from which you flee will surely meet you, then you will be sent back to (Allah), the All-Knower of the unseen and the seen, and He will tell you what you used to do."

source: يا أيها الذين آمنوا إذا نودي للصلاة من يوم الجمعة فاسعوا إلى ذكر الله وذروا البيع ذلكم خير لكم إن كنتم تعلمون
en: O you who believe (Muslims)! When the call is proclaimed for the Salat (prayer) on Friday (Jumu'ah prayer), come to the remembrance of Allah [Jumu'ah religious talk (Khutbah) and Salat (prayer)] and leave off business (and every other thing). That is better for you if you did but know!

source: فإذا قضيت الصلاة فانتشروا في الأرض وابتغوا من فضل الله واذكروا الله كثيرا لعلكم تفلحون
en: Then when the (Jumu'ah) Salat (prayer) is ended, you may disperse through the land, and seek the Bounty of Allah (by working, etc.), and remember Allah much: that you may be successful.

source: وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما قل ما عند الله خير من اللهو ومن التجارة والله خير الرازقين
en: And when they see some merchandise or some amusement [beating of Tambur (drum) etc.] they disperse headlong to it, and leave you (Muhammad صلى الله عليه وسلم) standing [while delivering Jumu'ah religious talk (Khutbah)]. Say: "That which Allah has is better than any amusement or merchandise! And Allah is the Best of providers."

source: إذا جاءك المنافقون قالوا نشهد إنك لرسول الله والله يعلم إنك لرسوله والله يشهد إن المنافقين لكاذبون
en: When the hypocrites come to you (O Muhammad صلى الله عليه وسلم), they say: "We bear witness that you are indeed the Messenger of Allah." Allah knows that you are indeed His Messenger, and Allah bears witness that the hypocrites are liars indeed.

source: اتخذوا أيمانهم جنة فصدوا عن سبيل الله إنهم ساء ما كانوا يعملون
en: They have made their oaths a screen (for their hypocrisy). Thus they hinder (men) from the Path of Allah. Verily, evil is what they used to do.

source: ذلك بأنهم آمنوا ثم كفروا فطبع على قلوبهم فهم لا يفقهون
en: That is because they believed, and then disbelieved; therefore their hearts are sealed, so they understand not.

source: وإذا رأيتهم تعجبك أجسامهم وإن يقولوا تسمع لقولهم كأنهم خشب مسندة يحسبون كل صيحة عليهم هم العدو فاحذرهم قاتلهم الله أنى يؤفكون
en: And when you look at them, their bodies please you; and when they speak, you listen to their words. They are as blocks of wood propped up. They think that every cry is against them. They are the enemies, so beware of them. May Allah curse them! How are they denying (or deviating from) the Right Path?

source: وإذا قيل لهم تعالوا يستغفر لكم رسول الله لووا رءوسهم ورأيتهم يصدون وهم مستكبرون
en: And when it is said to them: "Come, so that the Messenger of Allah may ask forgiveness from Allah for you," they twist their heads, and you would see them turning away their faces in pride.

source: سواء عليهم أستغفرت لهم أم لم تستغفر لهم لن يغفر الله لهم إن الله لا يهدي القوم الفاسقين
en: It is equal to them whether you (Muhammad صلى الله عليه وسلم) ask forgiveness or ask not forgiveness for them, Allah will never forgive them. Verily, Allah guides not the people who are the Fasiqin (rebellious, disobedient to Allah).

source: هم الذين يقولون لا تنفقوا على من عند رسول الله حتى ينفضوا ولله خزائن السماوات والأرض ولكن المنافقين لا يفقهون
en: They are the ones who say: "Spend not on those who are with Allah's Messenger, until they desert him." And to Allah belong the treasures of the heavens and the earth, but the hypocrites comprehend not.

source: يقولون لئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل ولله العزة ولرسوله وللمؤمنين ولكن المنافقين لا يعلمون
en: They (hyprocrites) say: "If we return to Al-Madinah, indeed the more honourable ('Abdullah bin Ubai bin Salul, the chief of hyprocrites at Al-Madinah) will expel therefrom the meaner (i.e. Allah's Messenger صلى الله عليه وسلم)." But honour, power and glory belong to Allah, and to His Messenger (Muhammad صلى الله عليه وسلم), and to the believers, but the hypocrites know not.

source: يا أيها الذين آمنوا لا تلهكم أموالكم ولا أولادكم عن ذكر الله ومن يفعل ذلك فأولئك هم الخاسرون
en: O you who believe! Let not your properties or your children divert you from the remembrance of Allah. And whosoever does that, then they are the losers.

source: وأنفقوا من ما رزقناكم من قبل أن يأتي أحدكم الموت فيقول رب لولا أخرتني إلى أجل قريب فأصدق وأكن من الصالحين
en: And spend (in charity) of that with which We have provided you before death comes to one of you, and he says: "My Lord! If only You would give me respite for a little while (i.e. return to the worldly life), then I should give Sadaqah (i.e. Zakat ) of my wealth, and be among the righteous [i.e. perform Hajj (pilgrimage to Makkah) and other good deeds].

source: ولن يؤخر الله نفسا إذا جاء أجلها والله خبير بما تعملون
en: And Allah grants respite to none when his appointed time (death) comes. And Allah is All-Aware of what you do.

source: يسبح لله ما في السماوات وما في الأرض له الملك وله الحمد وهو على كل شيء قدير
en: Whatsoever is in the heavens and whatsoever is on the earth glorifies Allah. His is the dominion, and to Him belong all the praises and thanks, and He is Able to do all things.

source: هو الذي خلقكم فمنكم كافر ومنكم مؤمن والله بما تعملون بصير
en: He it is Who created you, then some of you are disbelievers and some of you are believers. And Allah is All-Seer of what you do.

source: خلق السماوات والأرض بالحق وصوركم فأحسن صوركم وإليه المصير
en: He has created the heavens and the earth with truth, and He shaped you and made good your shapes. And to Him is the final Return.

source: يعلم ما في السماوات والأرض ويعلم ما تسرون وما تعلنون والله عليم بذات الصدور
en: He knows what is in the heavens and on earth, and He knows what you conceal and what you reveal. And Allah is the All-Knower of what is in the breasts (of men).

source: ألم يأتكم نبأ الذين كفروا من قبل فذاقوا وبال أمرهم ولهم عذاب أليم
en: Has not the news reached you of those who disbelieved aforetime? And so they tasted the evil result of their disbelief, and theirs will be a painful torment.

source: ذلك بأنه كانت تأتيهم رسلهم بالبينات فقالوا أبشر يهدوننا فكفروا وتولوا واستغنى الله والله غني حميد
en: That was because there came to them their Messengers with clear proofs (signs), but they said: "Shall mere men guide us?" So they disbelieved and turned away (from the truth). But Allah was not in need (of them). And Allah is Rich (Free of all needs), Worthy of all praise.

source: زعم الذين كفروا أن لن يبعثوا قل بلى وربي لتبعثن ثم لتنبؤن بما عملتم وذلك على الله يسير
en: The disbelievers pretend that they will never be resurrected (for the Account). Say (O Muhammad صلى الله عليه وسلم): Yes! By my Lord, you will certainly be resurrected, then you will be informed of (and recompensed for) what you did; and that is easy for Allah.

source: فآمنوا بالله ورسوله والنور الذي أنزلنا والله بما تعملون خبير
en: Therefore, believe in Allah and His Messenger (Muhammad صلى الله عليه وسلم) and in the Light (this Qur'an) which We have sent down. And Allah is All-Aware of what you do.

source: يوم يجمعكم ليوم الجمع ذلك يوم التغابن ومن يؤمن بالله ويعمل صالحا يكفر عنه سيئاته ويدخله جنات تجري من تحتها الأنهار خالدين فيها أبدا ذلك الفوز العظيم
en: (And remember) the Day when He will gather you (all) on the Day of Gathering, - that will be the Day of mutual loss and gain (i.e. loss for the disbelievers as they will enter the Hell-fire and gain for the believers as they will enter Paradise). And whosoever believes in Allah and performs righteous good deeds, He will expiate from him his sins, and will admit him to Gardens under which rivers flow (Paradise) to dwell therein forever; that will be the great success.

source: والذين كفروا وكذبوا بآياتنا أولئك أصحاب النار خالدين فيها وبئس المصير
en: But those who disbelieved (in the Oneness of Allah - Islamic Monotheism) and denied Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.), they will be the dwellers of the Fire, to dwell therein forever. And worst indeed is that destination .

source: ما أصاب من مصيبة إلا بإذن الله ومن يؤمن بالله يهد قلبه والله بكل شيء عليم
en: No calamity befalls, but by the Leave [i.e. Decision and Qadar (Divine Preordainments)] of Allah, and whosoever believes in Allah, He guides his heart [to the true Faith with certainty, i.e. what has befallen him was already written for him by Allah from the Qadar (Divine Preordainments)]. And Allah is the All-Knower of everything.

source: وأطيعوا الله وأطيعوا الرسول فإن توليتم فإنما على رسولنا البلاغ المبين
en: Obey Allah, and obey the Messenger (Muhammad صلى الله عليه وسلم); but if you turn away, then the duty of Our Messenger is only to convey (the Message) clearly.

source: الله لا إله إلا هو وعلى الله فليتوكل المؤمنون
en: Allah! La ilaha illa Huwa (none has the right to be worshipped but He). And in Allah (Alone) therefore, let the believers put their trust.

source: يا أيها الذين آمنوا إن من أزواجكم وأولادكم عدوا لكم فاحذروهم وإن تعفوا وتصفحوا وتغفروا فإن الله غفور رحيم
en: O you who believe! Verily, among your wives and your children there are enemies for you (who may stop you from the obedience of Allah); therefore beware of them! But if you pardon (them) and overlook, and forgive (their faults), then verily Allah is Oft-Forgiving, Most Merciful.

source: إنما أموالكم وأولادكم فتنة والله عنده أجر عظيم
en: Your wealth and your children are only a trial, whereas Allah! With Him is a great reward (Paradise).

source: فاتقوا الله ما استطعتم واسمعوا وأطيعوا وأنفقوا خيرا لأنفسكم ومن يوق شح نفسه فأولئك هم المفلحون
en: So keep your duty to Allah and fear Him as much as you can; listen and obey, and spend in charity; that is better for yourselves. And whosoever is saved from his own covetousness, then they are the successful ones.

source: إن تقرضوا الله قرضا حسنا يضاعفه لكم ويغفر لكم والله شكور حليم
en: If you lend Allah a goodly loan (i.e. spend in Allah's Cause), He will double it for you, and will forgive you. And Allah is Most Ready to appreciate and to reward, Most Forbearing,

source: عالم الغيب والشهادة العزيز الحكيم
en: All-Knower of the unseen and seen, the All-Mighty, the All-Wise.

source: يا أيها النبي إذا طلقتم النساء فطلقوهن لعدتهن وأحصوا العدة واتقوا الله ربكم لا تخرجوهن من بيوتهن ولا يخرجن إلا أن يأتين بفاحشة مبينة وتلك حدود الله ومن يتعد حدود الله فقد ظلم نفسه لا تدري لعل الله يحدث بعد ذلك أمرا
en: O Prophet (صلى الله عليه وسلم)! When you divorce women, divorce them at their 'Iddah (prescribed periods) and count (accurately) their 'Iddah (periods ). And fear Allah your Lord (O Muslims). And turn them not out of their (husband's) homes nor shall they (themselves) leave, except in case they are guilty of some open illegal sexual intercourse. And those are the set limits of Allah. And whosoever transgresses the set limits of Allah, then indeed he has wronged himself. You (the one who divorces his wife) know not it may be that Allah will afterward bring some new thing to pass (i.e. to return her back to you if that was the first or second divorce).

source: فإذا بلغن أجلهن فأمسكوهن بمعروف أو فارقوهن بمعروف وأشهدوا ذوي عدل منكم وأقيموا الشهادة لله ذلكم يوعظ به من كان يؤمن بالله واليوم الآخر ومن يتق الله يجعل له مخرجا
en: Then when they are about to attain their term appointed, either take them back in a good manner or part with them in a good manner. And take as witness two just persons from among you (Muslims). And establish the testimony for Allah. That will be an admonition given to him who believes in Allah and the Last Day. And whosoever fears Allah and keeps his duty to Him, He will make a way for him to get out (from every difficulty).

source: ويرزقه من حيث لا يحتسب ومن يتوكل على الله فهو حسبه إن الله بالغ أمره قد جعل الله لكل شيء قدرا
en: And He will provide him from (sources) he never could imagine. And whosoever puts his trust in Allah, then He will suffice him. Verily, Allah will accomplish his purpose. Indeed Allah has set a measure for all things.

source: واللائي يئسن من المحيض من نسائكم إن ارتبتم فعدتهن ثلاثة أشهر واللائي لم يحضن وأولات الأحمال أجلهن أن يضعن حملهن ومن يتق الله يجعل له من أمره يسرا
en: And those of your women as have passed the age of monthly courses, for them the 'Iddah (prescribed period), if you have doubt (about their periods), is three months; and for those who have no courses [(i.e. they are still immature) their 'Iddah (prescribed period) is three months likewise, except in case of death] . And for those who are pregnant (whether they are divorced or their husbands are dead), their 'Iddah (prescribed period) is until they lay down their burden; and whosoever fears Allah and keeps his duty to Him, He will make his matter easy for him.

source: ذلك أمر الله أنزله إليكم ومن يتق الله يكفر عنه سيئاته ويعظم له أجرا
en: That is the Command of Allah, which He has sent down to you; and whosoever fears Allah and keeps his duty to Him, He will expiate from him his sins, and will enlarge his reward.

source: أسكنوهن من حيث سكنتم من وجدكم ولا تضاروهن لتضيقوا عليهن وإن كن أولات حمل فأنفقوا عليهن حتى يضعن حملهن فإن أرضعن لكم فآتوهن أجورهن وأتمروا بينكم بمعروف وإن تعاسرتم فسترضع له أخرى
en: Lodge them (the divorced women) where you dwell, according to your means, and do not harm them so as to straiten them (that they be obliged to leave your house). And if they are pregnant, then spend on them till they lay down their burden. Then if they give suck to the children for you, give them their due payment, and let each of you accept the advice of the other in a just way. But if you make difficulties for one another, then some other woman may give suck for him (the father of the child).

source: لينفق ذو سعة من سعته ومن قدر عليه رزقه فلينفق مما آتاه الله لا يكلف الله نفسا إلا ما آتاها سيجعل الله بعد عسر يسرا
en: Let the rich man spend according to his means; and the man whose resources are restricted, let him spend according to what Allah has given him. Allah puts no burden on any person beyond what He has given him. Allah will grant after hardship, ease.

source: وكأين من قرية عتت عن أمر ربها ورسله فحاسبناها حسابا شديدا وعذبناها عذابا نكرا
en: And many a town (population) revolted against the Command of its Lord and His Messengers; and We called it to a severe account (i.e. torment in this worldly life), and We shall punish it with a horrible torment (in Hell in the Hereafter).

source: فذاقت وبال أمرها وكان عاقبة أمرها خسرا
en: So it tasted the evil result of its affair (disbelief), and the consequence of its affair (disbelief) was loss (destruction in this life and an eternal punishment in the Hereafter).

source: أعد الله لهم عذابا شديدا فاتقوا الله يا أولي الألباب الذين آمنوا قد أنزل الله إليكم ذكرا
en: Allah has prepared for them a severe torment. So fear Allah and keep your duty to Him, O men of understanding who have believed! Allah has indeed sent down to you a Reminder (this Qur'an).

source: رسولا يتلو عليكم آيات الله مبينات ليخرج الذين آمنوا وعملوا الصالحات من الظلمات إلى النور ومن يؤمن بالله ويعمل صالحا يدخله جنات تجري من تحتها الأنهار خالدين فيها أبدا قد أحسن الله له رزقا
en: (And has also sent to you) a Messenger (Muhammad صلى الله عليه وسلم), who recites to you the Verses of Allah (the Qur'an) containing clear explanations, that He may take out those who believe and do righteous good deeds, from the darkness (of polytheism and disbelief) to the light (of Islamic Monotheism). And whosoever believes in Allah and performs righteous good deeds, He will admit him into Gardens under which rivers flow (Paradise) to dwell therein forever. Allah has indeed granted for him an excellent provision.

source: الله الذي خلق سبع سماوات ومن الأرض مثلهن يتنزل الأمر بينهن لتعلموا أن الله على كل شيء قدير وأن الله قد أحاط بكل شيء علما
en: It is Allah Who has created seven heavens and of the earth the like thereof (i.e. seven). His Command descends between them (heavens and earth), that you may know that Allah has power over all things, and that Allah surrounds all things in (His) Knowledge.

source: يا أيها النبي لم تحرم ما أحل الله لك تبتغي مرضات أزواجك والله غفور رحيم
en: O Prophet! Why do you forbid (for yourself) that which Allah has allowed to you, seeking to please your wives? And Allah is Oft-Forgiving, Most Merciful.

source: قد فرض الله لكم تحلة أيمانكم والله مولاكم وهو العليم الحكيم
en: Allah has already ordained for you (O men) the absolution from your oaths. And Allah is your Maula (Lord, or Master, or Protector) and He is the All-Knower, the All-Wise.

source: وإذ أسر النبي إلى بعض أزواجه حديثا فلما نبأت به وأظهره الله عليه عرف بعضه وأعرض عن بعض فلما نبأها به قالت من أنبأك هذا قال نبأني العليم الخبير
en: And (remember) when the Prophet (صلى الله عليه وسلم) disclosed a matter in confidence to one of his wives (Hafsah), then she told it (to another i.e. 'Aishah). And Allah made it known to him; he informed part thereof and left a part. Then when he told her (Hafsah) thereof, she said: "Who told you this?" He said: "The All-Knower, the All-Aware (Allah) has told me."

source: إن تتوبا إلى الله فقد صغت قلوبكما وإن تظاهرا عليه فإن الله هو مولاه وجبريل وصالح المؤمنين والملائكة بعد ذلك ظهير
en: If you two (wives of the Prophet صلى الله عليه وسلم : 'Aishah and Hafsah رضي الله عنهما) turn in repentance to Allah, (it will be better for you), your hearts are indeed so inclined (to oppose what the Prophet صلى الله عليه وسلم likes); but if you help one another against him (Muhammad صلى الله عليه وسلم), then verily, Allah is his Maula (Lord, or Master, or Protector), and Jibril (Gabriel), and the righteous among the believers; and furthermore, the angels are his helpers.

source: عسى ربه إن طلقكن أن يبدله أزواجا خيرا منكن مسلمات مؤمنات قانتات تائبات عابدات سائحات ثيبات وأبكارا
en: It may be if he divorced you (all) that his Lord will give him instead of you, wives better than you - Muslims (who submit to Allah), believers, obedient (to Allah), turning to Allah in repentance, worshipping Allah sincerely, given to fasting or emigrants (for Allah's sake), previously married and virgins.

source: يا أيها الذين آمنوا قوا أنفسكم وأهليكم نارا وقودها الناس والحجارة عليها ملائكة غلاظ شداد لا يعصون الله ما أمرهم ويفعلون ما يؤمرون
en: O you who believe! Ward off yourselves and your families against a Fire (Hell) whose fuel is men and stones, over which are (appointed) angels stern (and) severe, who disobey not, (from executing) the Commands they receive from Allah, but do that which they are commanded.

source: يا أيها الذين كفروا لا تعتذروا اليوم إنما تجزون ما كنتم تعملون
en: (It will be said in the Hereafter) O you who disbelieve (in the Oneness of Allah - Islamic Monotheism)! Make no excuses this Day! You are being requited only for what you used to do.

source: يا أيها الذين آمنوا توبوا إلى الله توبة نصوحا عسى ربكم أن يكفر عنكم سيئاتكم ويدخلكم جنات تجري من تحتها الأنهار يوم لا يخزي الله النبي والذين آمنوا معه نورهم يسعى بين أيديهم وبأيمانهم يقولون ربنا أتمم لنا نورنا واغفر لنا إنك على كل شيء قدير
en: O you who believe! Turn to Allah with sincere repentance! It may be that your Lord will expiate from you your sins, and admit you into Gardens under which rivers flow (Paradise) - the Day that Allah will not disgrace the Prophet (Muhammad صلى الله عليه وسلم) and those who believe with him. Their Light will run forward before them and (with their Records - Books of deeds) in their right hands. They will say: "Our Lord! Keep perfect our Light for us [and do not put it off till we cross over the Sirat (a slippery bridge over the Hell) safely] and grant us forgiveness. Verily, You are Able to do all things."

source: ضرب الله مثلا للذين كفروا امرأت نوح وامرأت لوط كانتا تحت عبدين من عبادنا صالحين فخانتاهما فلم يغنيا عنهما من الله شيئا وقيل ادخلا النار مع الداخلين
en: Allah sets forth an example for those who disbelieve: the wife of Nuh (Noah) and the wife of Lut (Lot). They were under two of our righteous slaves, but they both betrayed them (their husbands by rejecting their doctrine). So they [Nuh (Noah) and Lut (Lot) عليهما السلام] availed them (their respective wives) not against Allah and it was said: "Enter the Fire along with those who enter!"

source: وضرب الله مثلا للذين آمنوا امرأت فرعون إذ قالت رب ابن لي عندك بيتا في الجنة ونجني من فرعون وعمله ونجني من القوم الظالمين
en: And Allah has set forth an example for those who believe: the wife of Fir'aun (Pharaoh), when she said: "My Lord! Build for me a home with You in Paradise, and save me from Fir'aun (Pharaoh) and his work, and save me from the people who are Zalimun (polytheists, wrong-doers and disbelievers in Allah).

source: ومريم ابنت عمران التي أحصنت فرجها فنفخنا فيه من روحنا وصدقت بكلمات ربها وكتبه وكانت من القانتين
en: And Maryam (Mary), the daughter of 'Imran who guarded her chastity. And We breathed into (the sleeve of her shirt or her garment) through Our Ruh [i.e. Jibril (Gabriel) ], and she testified to the truth of the Words of her Lord [i.e. believed in the Words of Allah: "Be!" - and he was; that is 'Îsa (Jesus), son of Maryam (Mary) as a Messenger of Allah], and (also believed in) His Scriptures, and she was of the Qanitun (i.e. obedient to Allah) .

source: تبارك الذي بيده الملك وهو على كل شيء قدير
en: Blessed be He in Whose Hand is the dominion; and He is Able to do all things.

source: الذي خلق الموت والحياة ليبلوكم أيكم أحسن عملا وهو العزيز الغفور
en: Who has created death and life that He may test you which of you is best in deed. And He is the All-Mighty, the Oft-Forgiving;
